{
  "config": {
    "abort": {
      "already_configured": "Gateway is already configured.",
      "reconfigure_successful": "Gateway has been re-configured."
    },
    "error": {
      "connection": "Unable to connect to the gateway.",
      "mqtt_component": "The MQTT component is unavailable.",
      "unable_to_calibrate": "The calibration process has encountered an issue and could not be completed successfully. Please ensure that your heating system is functioning properly and that all required sensors are connected and working correctly.\n\nIf you continue to experience issues with calibration, consider contacting us for further assistance. We apologize for any inconvenience caused."
    },
    "progress": {
      "calibration": "Calibrating and finding the overshoot protection value...\n\nPlease wait while we optimize your heating system. This process may take approximately 20 minutes."
    },
    "step": {
      "areas": {
        "data": {
          "main_climates": "Primary",
          "secondary_climates": "Rooms"
        },
        "description": "Settings related to climates, multi-room and temperature control. Primary climates are in the same room as the inside sensor and the rooms have their own target temperatures separate from the system.",
        "title": "Areas"
      },
      "automatic_gains": {
        "data": {
          "automatic_gains": "Automatic Gains (recommended)"
        },
        "description": "This feature adjusts the control parameters of your heating system dynamically, optimizing temperature control for better comfort and energy efficiency. Enabling this option allows SAT to continuously adapt and fine-tune the heating settings based on the environmental conditions. This helps maintain a stable and comfortable environment without manual intervention.\n\nNote: If you choose not to enable automatic gains, you will need to manually enter the PID values for precise temperature control. Please ensure that you have accurate PID values for your specific heating system to achieve optimal performance.",
        "title": "Automatic Gains"
      },
      "calibrate_system": {
        "description": "Optimize your heating system by automatically determining the optimal PID values for your setup. When selecting Automatic Gains, please note that the system will go through a calibration process that may take approximately 20 minutes to complete.\n\nAutomatic Gains is recommended for most users as it simplifies the setup process and ensures optimal performance. However, if you're familiar with PID control and prefer to manually set the values, you can choose to skip Automatic Gains.\n\nPlease note that choosing to skip Automatic Gains requires a good understanding of PID control and may require additional manual adjustments to achieve optimal performance.",
        "menu_options": {
          "calibrate": "Calibrate and determine your overshoot protection value (approx. 20 min).",
          "overshoot_protection": "Manually enter the overshoot protection value.",
          "pid_controller": "Manually enter PID values (not recommended)."
        },
        "title": "Calibrate System"
      },
      "calibrated": {
        "description": "The calibration process has completed successfully.\n\nCongratulations! Your Smart Autotune Thermostat (SAT) has been calibrated to optimize the heating performance of your system. During the calibration process, SAT carefully analyzed the heating characteristics and determined the appropriate overshoot protection value to ensure precise temperature control.\n\nOvershoot Protection Value: {minimum_setpoint} °C\n\nThis value represents the maximum amount of overshoot allowed during the heating process. SAT will actively monitor and adjust the heating to prevent excessive overshooting, maintaining a comfortable and efficient heating experience in your home.\n\nPlease note that the overshoot protection value may vary depending on the specific characteristics of your heating system and environmental factors. It has been fine-tuned to provide optimal performance based on the calibration results.",
        "menu_options": {
          "calibrate": "Retry calibration",
          "finish": "Continue with current calibration"
        },
        "title": "Calibration Completed"
      },
      "heating_system": {
        "data": {
          "heating_system": "System"
        },
        "description": "Selecting the correct heating system type is important for SAT to accurately control the temperature and optimize performance. Choose the option that matches your setup to ensure proper temperature regulation throughout your home.",
        "title": "Heating System"
      },
      "mosquitto": {
        "data": {
          "device": "Device",
          "mqtt_topic": "Top Topic",
          "name": "Name"
        },
        "description": "Please provide the following details to set up the OpenTherm Gateway. In the Name field, enter a name for the gateway that will help you identify it within your system.\n\nSpecify the Climate entity to use for the OpenTherm Gateway. This entity is provided by the OpenTherm Gateway and represents your heating system.\n\nAdditionally, enter the Top Topic that will be used for publishing and subscribing to MQTT messages related to the OpenTherm Gateway.\n\nThese settings are essential for establishing communication and integration with your OpenTherm Gateway through MQTT. They allow for seamless data exchange and control of your heating system. Ensure that the provided details are accurate to ensure proper functionality.",
        "title": "OpenTherm Gateway ( MQTT )"
      },
      "overshoot_protection": {
        "data": {
          "minimum_setpoint": "Value"
        },
        "description": "By providing the overshoot protection value, SAT will adjust the control parameters accordingly to maintain a stable and comfortable heating environment. This manual configuration allows you to fine-tune the system based on your specific setup.\n\nNote: If you are unsure about the overshoot protection value or have not performed the calibration process, it is recommended to cancel the configuration and go through the calibration process to let SAT automatically determine the value for optimal performance.",
        "title": "Overshoot Protection"
      },
      "pid_controller": {
        "data": {
          "derivative": "Derivative (kD)",
          "integral": "Integral (kI)",
          "proportional": "Proportional (kP)"
        },
        "description": "Configure the proportional, integral, and derivative gains manually to fine-tune your heating system. Use this option if you prefer to have full control over the PID controller parameters. Adjust the gains based on your specific heating system characteristics and preferences.",
        "title": "Configure the PID controller manually."
      },
      "sensors": {
        "data": {
          "humidity_sensor_entity_id": "Humidity Sensor Entity",
          "inside_sensor_entity_id": "Inside Sensor Entity",
          "outside_sensor_entity_id": "Outside Sensor Entity"
        },
        "description": "Please select the sensors that will be used to track the temperature.",
        "title": "Configure sensors"
      },
      "serial": {
        "data": {
          "device": "URL",
          "name": "Name"
        },
        "description": "To establish a connection with the OpenTherm Gateway using a socket connection, please provide the following details. In the Name field, enter a name for the gateway that will help you identify it within your system.\n\nSpecify the network address of the OpenTherm Gateway in the Device field. This could be in the format of \"socket://otgw.local:25238\", where \"otgw.local\" is the hostname or IP address of the gateway and \"25238\" is the port number.\n\nThese settings are essential for establishing communication and integration with your OpenTherm Gateway through the socket connection. Ensure that the provided details are accurate to ensure proper functionality.",
        "title": "OpenTherm Gateway ( SERIAL )"
      },
      "simulator": {
        "data": {
          "maximum_setpoint": "Maximum Setpoint",
          "minimum_setpoint": "Minimum Setpoint",
          "name": "Name",
          "simulated_cooling": "Simulated Cooling",
          "simulated_heating": "Simulated Heating",
          "simulated_warming_up": "Simulated Warming Up"
        },
        "description": "This gateway allows you to simulate a boiler for testing and demonstration purposes. Please provide the following information to configure the simulator.\n\nNote: The Simulator Gateway is intended for testing and demonstration purposes only and should not be used in production environments.",
        "title": "Simulated Gateway ( ADVANCED )"
      },
      "switch": {
        "data": {
          "device": "Entity",
          "minimum_setpoint": "Temperature Setting",
          "name": "Name"
        },
        "description": "Please fill in the following details to set up the switch. Enter a name for the switch in the Name field, which will help you identify it within your system. Choose the appropriate entity to use for your switch from the provided options.\n\nIn the Temperature Setting field, specify the desired target temperature for your heating system. If you are using a hot water boiler, fill in the Boiler Temperature Setting with the appropriate value. For electric heating systems, enter the value 100.\n\nThese settings are essential for precise temperature control and ensuring optimal performance of your heating system. Providing the correct Temperature Setting allows for accurate regulation and helps achieve a comfortable and energy-efficient environment in your home.",
        "title": "PID Thermostat with PWM ( ON/OFF )"
      },
      "user": {
        "description": "SAT is a smart thermostat that is capable of auto-tuning itself to optimize temperature control. Select the appropriate mode that matches your heating system.",
        "menu_options": {
          "mosquitto": "OpenTherm Gateway ( MQTT )",
          "serial": "OpenTherm Gateway ( SERIAL )",
          "esphome": "OpenTherm Gateway ( ESPHOME )",
          "simulator": "Simulated Gateway ( ADVANCED )",
          "switch": "PID Thermostat with PWM ( ON/OFF )"
        },
        "title": "Smart Autotune Thermostat (SAT)"
      }
    }
  },
  "options": {
    "step": {
      "advanced": {
        "data": {
          "climate_valve_offset": "Climate valve offset",
          "dynamic_minimum_setpoint": "Dynamic Minimum Setpoint (Experimental)",
          "force_pulse_width_modulation": "Force Pulse Width Modulation",
          "maximum_consumption": "Maximum Consumption",
          "maximum_relative_modulation": "Maximum Relative Modulation",
          "minimum_consumption": "Minimum Consumption",
          "sample_time": "Sample Time",
          "simulation": "Simulation",
          "target_temperature_step": "Target Temperature Step",
          "thermal_comfort": "Thermal Comfort"
        },
        "data_description": {
          "climate_valve_offset": "Offset to adjust the opening degree of the climate valve.",
          "dynamic_minimum_setpoint": "Activates the dynamic setpoint adjustment based on the boiler's return temperature, which also helps identify if any valves are closed.",
          "maximum_consumption": "The maximum gas consumption when the boiler is active.",
          "maximum_relative_modulation": "Representing the highest modulation level for an efficient heating system.",
          "minimum_consumption": "The minimum gas consumption when the boiler is active.",
          "sample_time": "The minimum time interval between updates to the PID controller.",
          "target_temperature_step": "Adjust the target temperature step for fine-tuning comfort levels.",
          "thermal_comfort": "Enable the use of the Simmer Index for thermal comfort adjustment."
        },
        "title": "Advanced"
      },
      "general": {
        "data": {
          "automatic_gains_value": "Automatic Gains Value",
          "derivative": "Derivative (kD)",
          "derivative_time_weight": "Derivative Time Weight",
          "duty_cycle": "Maximum Duty Cycle for Pulse Width Modulation",
          "heating_curve_coefficient": "Heating Curve Coefficient",
          "heating_curve_version": "Heating Curve Version",
          "integral": "Integral (kI)",
          "maximum_setpoint": "Maximum Setpoint",
          "minimum_setpoint_adjustment_factor": "Adjustment Factor for Return Temperature",
          "pid_controller_version": "PID Controller Version",
          "proportional": "Proportional (kP)",
          "sync_with_thermostat": "Synchronize setpoint with thermostat",
          "window_sensors": "Contact Sensors",
          "heating_mode": "Heating Mode"
        },
        "data_description": {
          "automatic_gains_value": "The value used for automatic gains in the PID controller.",
          "derivative": "The derivative term (kD) in the PID controller, responsible for mitigating overshooting.",
          "derivative_time_weight": "A parameter to adjust the influence of the derivative term over time, particularly useful for reducing undershoot during the warm-up phase when the heating curve coefficient is correctly set.",
          "duty_cycle": "The maximum duty cycle for Pulse Width Modulation (PWM), controlling the boiler's on-off cycles.",
          "heating_curve_coefficient": "The coefficient used to adjust the heating curve.",
          "integral": "The integral term (kI) in the PID controller, responsible for reducing steady-state error.",
          "maximum_setpoint": "The optimal temperature for efficient boiler operation.",
          "minimum_setpoint_adjustment_factor": "This factor adjusts the heating setpoint based on the boiler's return temperature, affecting heating responsiveness and efficiency. A higher value increases sensitivity to temperature changes, enhancing control over comfort and energy use. Recommended starting range is 0.1 to 0.5. Adjust to suit your system and comfort preferences.",
          "proportional": "The proportional term (kP) in the PID controller, responsible for the immediate response to errors.",
          "sync_with_thermostat": "Synchronize setpoint with thermostat to ensure coordinated temperature control.",
          "window_sensors": "Contact Sensors that trigger the system to react when a window or door is open for a period of time."
        },
        "description": "General settings and configurations.",
        "title": "General"
      },
      "init": {
        "menu_options": {
          "advanced": "Advanced Options",
          "general": "General",
          "presets": "Presets",
          "system_configuration": "System Configuration"
        }
      },
      "presets": {
        "data": {
          "activity_temperature": "Activity Temperature",
          "away_temperature": "Away Temperature",
          "comfort_temperature": "Comfort Temperature",
          "home_temperature": "Home Temperature",
          "sleep_temperature": "Sleep Temperature",
          "sync_climates_with_preset": "Synchronize climates with preset (sleep / away / activity)"
        },
        "description": "Predefined temperature settings for different scenarios or activities.",
        "title": "Presets"
      },
      "system_configuration": {
        "data": {
          "automatic_duty_cycle": "Automatic duty cycle",
          "sync_climates_with_mode": "Synchronize climates with mode",
          "overshoot_protection": "Overshoot Protection (with PWM)",
          "sensor_max_value_age": "Temperature Sensor maximum value age",
          "window_minimum_open_time": "Minimum time for window to be open"
        },
        "data_description": {
          "automatic_duty_cycle": "Enable or disable automatic duty cycle for Pulse Width Modulation (PWM).",
          "overshoot_protection": "Enable overshoot protection with Pulse Width Modulation (PWM) to prevent boiler temperature overshooting.",
          "sensor_max_value_age": "The maximum age of the temperature sensor value before considering it as a stall.",
          "window_minimum_open_time": "The minimum time a window must be open before the system reacts."
        },
        "description": "For fine-tuning and customization.",
        "title": "System Configuration"
      }
    }
  }
}