{
  "config": {
    "abort": {
      "already_configured": "La passerelle est déjà configurée.",
      "reconfigure_successful": "La passerelle a été reconfigurée."
    },
    "error": {
      "connection": "Impossible de se connecter à la passerelle.",
      "mqtt_component": "Le composant MQTT n'est pas disponible.",
      "unable_to_calibrate": "Le processus de calibration a rencontré un problème et n'a pas pu être complété avec succès. Veuillez vous assurer que votre système de chauffage fonctionne correctement et que tous les capteurs requis sont connectés et fonctionnent correctement.\n\nSi vous continuez à rencontrer des problèmes avec la calibration, envisagez de nous contacter pour obtenir de l'aide supplémentaire. Nous nous excusons pour tout désagrément causé."
    },
    "progress": {
      "calibration": "Calibration et recherche de la valeur de protection contre les dépassements en cours...\n\nVeuillez patienter pendant que nous optimisons votre système de chauffage. Ce processus peut prendre environ 20 minutes."
    },
    "step": {
      "areas": {
        "data": {
          "main_climates": "Principaux",
          "secondary_climates": "Pièces"
        },
        "description": "Paramètres liés aux climats, aux pièces multiples et au contrôle de la température. Les climats principaux se trouvent dans la même pièce que le capteur intérieur et les pièces ont leurs propres températures cibles séparées du système.",
        "title": "Zones"
      },
      "automatic_gains": {
        "data": {
          "automatic_gains": "Gains automatiques (recommandé)"
        },
        "description": "Cette fonctionnalité ajuste les paramètres de contrôle de votre système de chauffage de manière dynamique, optimisant le contrôle de la température pour un meilleur confort et une meilleure efficacité énergétique. Activer cette option permet au SAT de s'adapter continuellement et d'affiner les réglages de chauffage en fonction des conditions environnementales. Cela aide à maintenir un environnement stable et confortable sans intervention manuelle.\n\nNote : Si vous choisissez de ne pas activer les gains automatiques, vous devrez entrer manuellement les valeurs PID pour un contrôle précis de la température. Veuillez vous assurer que vous disposez de valeurs PID précises pour votre système de chauffage spécifique afin d'obtenir des performances optimales.",
        "title": "Gains automatiques"
      },
      "calibrate_system": {
        "description": "Optimisez votre système de chauffage en déterminant automatiquement les valeurs PID optimales pour votre configuration. Lors de la sélection des Gains automatiques, veuillez noter que le système passera par un processus de calibration qui peut prendre environ 20 minutes à compléter.\n\nLes Gains automatiques sont recommandés pour la plupart des utilisateurs car ils simplifient le processus de configuration et garantissent des performances optimales. Cependant, si vous êtes familier avec le contrôle PID et que vous préférez définir manuellement les valeurs, vous pouvez choisir de ne pas activer les Gains automatiques.\n\nVeuillez noter que choisir de ne pas activer les Gains automatiques nécessite une bonne connaissance du contrôle PID et peut nécessiter des ajustements manuels supplémentaires pour obtenir des performances optimales.",
        "menu_options": {
          "calibrate": "Calibrer et déterminer votre valeur de protection contre les dépassements (env. 20 min).",
          "overshoot_protection": "Entrer manuellement la valeur de protection contre les dépassements.",
          "pid_controller": "Entrer manuellement les valeurs PID (non recommandé)."
        },
        "title": "Calibrer le système"
      },
      "calibrated": {
        "description": "Le processus de calibration a été complété avec succès.\n\nFélicitations ! Votre Smart Autotune Thermostat (SAT) a été calibré pour optimiser la performance de chauffage de votre système. Au cours du processus de calibration, le SAT a analysé soigneusement les caractéristiques de chauffage et déterminé la valeur de protection contre les dépassements appropriée pour garantir un contrôle précis de la température.\n\nValeur de protection contre les dépassements : {minimum_setpoint} °C\n\nCette valeur représente la quantité maximale de dépassement autorisée pendant le processus de chauffage. Le SAT surveillera activement et ajustera le chauffage pour éviter un dépassement excessif, maintenant ainsi une expérience de chauffage confortable et efficace dans votre maison.\n\nVeuillez noter que la valeur de protection contre les dépassements peut varier en fonction des caractéristiques spécifiques de votre système de chauffage et des facteurs environnementaux. Elle a été affinée pour fournir des performances optimales basées sur les résultats de la calibration.",
        "menu_options": {
          "calibrate": "Réessayer la calibration",
          "finish": "Continuer avec la calibration actuelle"
        },
        "title": "Calibration terminée"
      },
      "heating_system": {
        "data": {
          "heating_system": "Système"
        },
        "description": "Sélectionner le type de système de chauffage correct est important pour que le SAT contrôle précisément la température et optimise les performances. Choisissez l'option qui correspond à votre configuration pour garantir une régulation appropriée de la température dans votre maison.",
        "title": "Système de chauffage"
      },
      "mosquitto": {
        "data": {
          "device": "Appareil",
          "mqtt_topic": "Sujet Principal",
          "name": "Nom"
        },
        "description": "Veuillez fournir les détails suivants pour configurer la passerelle OpenTherm. Dans le champ Nom, entrez un nom pour la passerelle qui vous aidera à l'identifier au sein de votre système.\n\nSpécifiez l'entité Climat à utiliser pour la passerelle OpenTherm. Cette entité est fournie par la passerelle OpenTherm et représente votre système de chauffage.\n\nDe plus, entrez le Sujet principal qui sera utilisé pour publier et s'abonner aux messages MQTT liés à la passerelle OpenTherm.\n\nCes paramètres sont essentiels pour établir la communication et l'intégration avec votre passerelle OpenTherm via MQTT. Ils permettent un échange de données et un contrôle fluides de votre système de chauffage. Assurez-vous que les détails fournis sont précis pour garantir une fonctionnalité appropriée.",
        "title": "OpenTherm Gateway ( MQTT )"
      },
      "overshoot_protection": {
        "data": {
          "minimum_setpoint": "Valeur"
        },
        "description": "En fournissant la valeur de protection contre les dépassements, le SAT ajustera les paramètres de contrôle en conséquence pour maintenir un environnement de chauffage stable et confortable. Cette configuration manuelle vous permet d'affiner le système en fonction de votre configuration spécifique.\n\nNote : Si vous n'êtes pas sûr de la valeur de protection contre les dépassements ou si vous n'avez pas effectué le processus de calibration, il est recommandé d'annuler la configuration et de passer par le processus de calibration pour permettre au SAT de déterminer automatiquement la valeur pour des performances optimales.",
        "title": "Protection contre les dépassements"
      },
      "pid_controller": {
        "data": {
          "derivative": "Dérivé (kD)",
          "integral": "Intégral (kI)",
          "proportional": "Proportionnel (kP)"
        },
        "description": "Configurez manuellement les gains proportionnel, intégral et dérivé pour affiner votre système de chauffage. Utilisez cette option si vous préférez avoir un contrôle total sur les paramètres du contrôleur PID. Ajustez les gains en fonction des caractéristiques spécifiques de votre système de chauffage et de vos préférences.",
        "title": "Configurer manuellement le contrôleur PID."
      },
      "sensors": {
        "data": {
          "humidity_sensor_entity_id": "Entité du capteur d'humidité",
          "inside_sensor_entity_id": "Entité du capteur intérieur",
          "outside_sensor_entity_id": "Entité du capteur extérieur"
        },
        "description": "Veuillez sélectionner les capteurs qui seront utilisés pour suivre la température.",
        "title": "Configurer les capteurs"
      },
      "serial": {
        "data": {
          "device": "URL",
          "name": "Nom"
        },
        "description": "Pour établir une connexion avec la passerelle OpenTherm en utilisant une connexion socket, veuillez fournir les détails suivants. Dans le champ Nom, entrez un nom pour la passerelle qui vous aidera à l'identifier au sein de votre système.\n\nSpécifiez l'adresse réseau de la passerelle OpenTherm dans le champ Appareil. Cela pourrait être au format \"socket://otgw.local:25238\", où \"otgw.local\" est le nom d'hôte ou l'adresse IP de la passerelle et \"25238\" est le numéro de port.\n\nCes paramètres sont essentiels pour établir la communication et l'intégration avec votre passerelle OpenTherm via la connexion socket. Assurez-vous que les détails fournis sont précis pour garantir une fonctionnalité appropriée.",
        "title": "OpenTherm Gateway ( SERIAL )"
      },
      "simulator": {
        "data": {
          "maximum_setpoint": "Réglage maximal",
          "minimum_setpoint": "Réglage minimal",
          "name": "Nom",
          "simulated_cooling": "Refroidissement simulé",
          "simulated_heating": "Chauffage simulé",
          "simulated_warming_up": "Réchauffement simulé"
        },
        "description": "Cette passerelle vous permet de simuler une chaudière à des fins de test et de démonstration. Veuillez fournir les informations suivantes pour configurer le simulateur.\n\nNote : La Passerelle Simulateur est destinée à des fins de test et de démonstration uniquement et ne doit pas être utilisée dans des environnements de production.",
        "title": "Passerelle simulée ( AVANCÉ )"
      },
      "switch": {
        "data": {
          "device": "Entité",
          "minimum_setpoint": "Réglage de la température",
          "name": "Nom"
        },
        "description": "Veuillez remplir les détails suivants pour configurer l'interrupteur. Entrez un nom pour l'interrupteur dans le champ Nom, ce qui vous aidera à l'identifier au sein de votre système. Choisissez l'entité appropriée à utiliser pour votre interrupteur parmi les options fournies.\n\nDans le champ Réglage de la température, spécifiez la température cible désirée pour votre système de chauffage. Si vous utilisez une chaudière à eau chaude, remplissez le Réglage de la température de la chaudière avec la valeur appropriée. Pour les systèmes de chauffage électrique, entrez la valeur 100.\n\nCes paramètres sont essentiels pour un contrôle précis de la température et pour garantir des performances optimales de votre système de chauffage. Fournir le Réglage de la température correct permet une régulation précise et contribue à créer un environnement confortable et économe en énergie dans votre maison.",
        "title": "Thermostat PID avec PWM (ON/OFF)"
      },
      "user": {
        "description": "Le SAT est un thermostat intelligent capable de s'auto-ajuster pour optimiser le contrôle de la température. Sélectionnez le mode approprié qui correspond à votre système de chauffage.",
        "menu_options": {
          "mosquitto": "OpenTherm Gateway ( MQTT )",
          "serial": "OpenTherm Gateway ( SERIAL )",
          "simulator": "Passerelle simulée ( AVANCÉ )",
          "switch": "Thermostat PID avec PWM ( ON/OFF )"
        },
        "title": "Smart Autotune Thermostat (SAT)"
      }
    }
  },
  "options": {
    "step": {
      "advanced": {
        "data": {
          "climate_valve_offset": "Décalage de la vanne climatique",
          "dynamic_minimum_setpoint": "Point de Consigne Minimum Dynamique (Expérimental)",
          "force_pulse_width_modulation": "Forcer la Modulation de Largeur d'Impulsion",
          "maximum_consumption": "Consommation Maximale",
          "maximum_relative_modulation": "Modulation Relative Maximale",
          "minimum_consumption": "Consommation Minimale",
          "sample_time": "Temps d'Échantillonnage",
          "simulation": "Simulation",
          "target_temperature_step": "Pas de Température Cible",
          "thermal_comfort": "Confort Thermique"
        },
        "data_description": {
          "climate_valve_offset": "Décalage pour ajuster le degré d'ouverture de la vanne climatique.",
          "dynamic_minimum_setpoint": "Active l'ajustement dynamique du point de consigne minimal en fonction de la température de retour de la chaudière, ce qui aide également à identifier si des vannes sont fermées.",
          "maximum_consumption": "La consommation maximale de gaz lorsque la chaudière est active.",
          "maximum_relative_modulation": "Représentant le niveau de modulation le plus élevé pour un système de chauffage efficace.",
          "minimum_consumption": "La consommation minimale de gaz lorsque la chaudière est active.",
          "sample_time": "L'intervalle de temps minimum entre les mises à jour du régulateur PID.",
          "target_temperature_step": "Ajuster le pas de température cible pour un réglage fin des niveaux de confort.",
          "thermal_comfort": "Activer l'utilisation de l'Indice de Simmer pour ajuster le confort thermique."
        },
        "title": "Avancé"
      },
      "general": {
        "data": {
          "automatic_gains_value": "Valeur de Gains Automatiques",
          "derivative": "Dérivé (kD)",
          "derivative_time_weight": "Poids Temporel Dérivé",
          "duty_cycle": "Cycle de Fonctionnement Maximum pour la Modulation de Largeur d'Impulsion",
          "heating_curve_coefficient": "Coefficient de la Courbe de Chauffage",
          "heating_curve_version": "Version de la Courbe de Chauffage",
          "integral": "Intégral (kI)",
          "maximum_setpoint": "Point de consigne maximal",
          "minimum_setpoint_adjustment_factor": "Facteur d'ajustement du point de consigne minimal",
          "pid_controller_version": "Version du contrôleur PID",
          "proportional": "Proportionnel (kP)",
          "sync_with_thermostat": "Synchroniser le point de consigne avec le thermostat",
          "window_sensors": "Capteurs de Contact",
          "heating_mode": "Mode chauffage"
        },
        "data_description": {
          "automatic_gains_value": "La valeur utilisée pour les gains automatiques dans le régulateur PID.",
          "derivative": "Le terme dérivé (kD) dans le régulateur PID, responsable de l'atténuation des dépassements.",
          "derivative_time_weight": "Un paramètre pour ajuster l'influence du terme dérivé au fil du temps, particulièrement utile pour réduire le dépassement lors de la phase de montée en température lorsque le coefficient de la courbe de chauffage est correctement réglé.",
          "duty_cycle": "Le cycle de fonctionnement maximum pour la Modulation de Largeur d'Impulsion (PWM), contrôlant les cycles de marche/arrêt de la chaudière.",
          "heating_curve_coefficient": "Le coefficient utilisé pour ajuster la courbe de chauffage.",
          "integral": "Le terme intégral (kI) dans le régulateur PID, responsable de la réduction de l'erreur en régime permanent.",
          "maximum_setpoint": "La température optimale pour un fonctionnement efficace de la chaudière.",
          "minimum_setpoint_adjustment_factor": "Ce facteur ajuste le point de consigne du chauffage en fonction de la température de retour de la chaudière, influençant la réactivité et l'efficacité du chauffage. Une valeur plus élevée augmente la sensibilité aux changements de température, améliorant le contrôle du confort et de l'utilisation de l'énergie. La plage de départ recommandée est de 0,1 à 0,5. Ajustez pour convenir à votre système et à vos préférences de confort.",
          "proportional": "Le terme proportionnel (kP) dans le régulateur PID, responsable de la réponse immédiate aux erreurs.",
          "sync_with_thermostat": "Synchroniser le point de consigne avec le thermostat pour assurer une régulation coordonnée de la température.",
          "window_sensors": "Capteurs de Contact qui déclenchent le système lorsqu'une fenêtre ou une porte est ouverte pendant une période."
        },
        "description": "Paramètres et configurations généraux.",
        "title": "Général"
      },
      "init": {
        "menu_options": {
          "advanced": "Options Avancées",
          "general": "Général",
          "presets": "Préréglages",
          "system_configuration": "Configuration du Système"
        }
      },
      "presets": {
        "data": {
          "activity_temperature": "Température Activité",
          "away_temperature": "Température Absence",
          "comfort_temperature": "Température Confort",
          "home_temperature": "Température Maison",
          "sleep_temperature": "Température Sommeil",
          "sync_climates_with_preset": "Synchroniser les climats avec le préréglage (sommeil / absence / activité)"
        },
        "description": "Paramètres de température prédéfinis pour différents scénarios ou activités.",
        "title": "Préréglages"
      },
      "system_configuration": {
        "data": {
          "automatic_duty_cycle": "Cycle de fonctionnement automatique",
          "sync_climates_with_mode": "Synchroniser les climats avec le mode",
          "overshoot_protection": "Protection contre le dépassement (avec PWM)",
          "sensor_max_value_age": "Âge maximal de la valeur du capteur de température",
          "window_minimum_open_time": "Temps minimum d'ouverture de la fenêtre"
        },
        "data_description": {
          "automatic_duty_cycle": "Activer ou désactiver le cycle de fonctionnement automatique pour la Modulation de Largeur d'Impulsion (PWM).",
          "overshoot_protection": "Activer la protection contre le dépassement avec la Modulation de Largeur d'Impulsion (PWM) pour prévenir les dépassements de température de la chaudière.",
          "sensor_max_value_age": "L'âge maximum de la valeur du capteur de température avant de la considérer comme stagnante.",
          "window_minimum_open_time": "Le temps minimum qu'une fenêtre doit être ouverte avant que le système ne réagisse."
        },
        "description": "Pour un réglage fin et une personnalisation.",
        "title": "Configuration du Système"
      }
    }
  }
}