{
  "config": {
    "abort": {
      "already_configured": "Il gateway è già configurato.",
      "reconfigure_successful": "Il gateway è stato riconfigurato."
    },
    "error": {
      "invalid_device": "Questo è un dispositivo non valido.",
      "connection": "Impossibile connettersi al gateway.",
      "mqtt_component": "Il componente MQTT non è disponibile.",
      "unable_to_calibrate": "Il processo di calibrazione ha incontrato un problema e non è stato completato con successo. Si prega di assicurarsi che il sistema di riscaldamento funzioni correttamente e che tutti i sensori richiesti siano connessi e funzionanti correttamente.\n\nSe continui a riscontrare problemi con la calibrazione, considera di contattarci per ulteriore assistenza. Ci scusiamo per eventuali inconvenienti causati."
    },
    "progress": {
      "calibration": "Calibrazione e ricerca del valore di protezione dal superamento in corso...\n\nSi prega di attendere mentre ottimizziamo il tuo sistema di riscaldamento. Questo processo può richiedere circa 20 minuti."
    },
    "step": {
      "areas": {
        "data": {
          "thermostat": "Termostato",
          "main_climates": "Primari",
          "secondary_climates": "Stanze"
        },
        "data_description": {
          "thermostat": "Termostato esistente opzionale per sincronizzare i setpoint.",
          "main_climates": "Radiatori nella stessa stanza del sensore interno.",
          "secondary_climates": "Stanze con le proprie temperature target."
        },
        "description": "Impostazioni relative ai climi, alle stanze multiple e al controllo della temperatura. I climi primari sono nella stessa stanza del sensore interno e le stanze hanno le loro temperature obiettivo separate dal sistema.",
        "title": "Aree"
      },
      "automatic_gains": {
        "data": {
          "automatic_gains": "Guadagni Automatici (raccomandato)"
        },
        "description": "Questa funzionalità regola dinamicamente i parametri di controllo del tuo sistema di riscaldamento, ottimizzando il controllo della temperatura per un maggiore comfort e efficienza energetica. Attivare questa opzione consente al SAT di adattarsi continuamente e di perfezionare le impostazioni di riscaldamento in base alle condizioni ambientali. Ciò aiuta a mantenere un ambiente stabile e confortevole senza interventi manuali.\n\nNota: Se scegli di non abilitare i guadagni automatici, dovrai inserire manualmente i valori PID per un controllo preciso della temperatura. Assicurati di avere valori PID accurati per il tuo specifico sistema di riscaldamento per ottenere prestazioni ottimali.",
        "title": "Guadagni Automatici"
      },
      "calibrate_system": {
        "description": "Ottimizza il tuo sistema di riscaldamento determinando automaticamente i valori PID ottimali per la tua configurazione. Quando selezioni Guadagni Automatici, si prega di notare che il sistema passerà attraverso un processo di calibrazione che potrebbe richiedere circa 20 minuti per completarsi.\n\nI Guadagni Automatici sono raccomandati per la maggior parte degli utenti in quanto semplificano il processo di configurazione e garantiscono prestazioni ottimali. Tuttavia, se sei familiare con il controllo PID e preferisci impostare manualmente i valori, puoi scegliere di non attivare i Guadagni Automatici.\n\nSi prega di notare che scegliere di non attivare i Guadagni Automatici richiede una buona conoscenza del controllo PID e potrebbe richiedere ulteriori regolazioni manuali per ottenere prestazioni ottimali.",
        "menu_options": {
          "calibrate": "Calibra e determina il tuo valore di protezione dal superamento (circa 20 min).",
          "overshoot_protection": "Inserisci manualmente il valore di protezione dal superamento.",
          "pid_controller": "Inserisci manualmente i valori PID (non raccomandato)."
        },
        "title": "Calibra Sistema"
      },
      "calibrated": {
        "description": "Il processo di calibrazione è stato completato con successo.\n\nCongratulazioni! Il tuo Smart Autotune Thermostat (SAT) è stato calibrato per ottimizzare le prestazioni di riscaldamento del tuo sistema. Durante il processo di calibrazione, il SAT ha analizzato attentamente le caratteristiche di riscaldamento e determinato il valore appropriato di protezione dal superamento per garantire un controllo preciso della temperatura.\n\nValore di Protezione dal Superamento: {minimum_setpoint} °C\n\nQuesto valore rappresenta la quantità massima di superamento consentita durante il processo di riscaldamento. Il SAT monitorerà attivamente e regolerà il riscaldamento per evitare un superamento eccessivo, mantenendo così un'esperienza di riscaldamento confortevole ed efficiente nella tua casa.\n\nSi prega di notare che il valore di protezione dal superamento può variare a seconda delle caratteristiche specifiche del tuo sistema di riscaldamento e dei fattori ambientali. È stato affinato per fornire prestazioni ottimali in base ai risultati della calibrazione.",
        "menu_options": {
          "calibrate": "Riprova la calibrazione",
          "finish": "Continua con la calibrazione attuale"
        },
        "title": "Calibrazione Completata"
      },
      "heating_system": {
        "data": {
          "heating_system": "Sistema"
        },
        "data_description": {
          "heating_system": "Scegli il sistema che corrisponde ai tuoi terminali di calore."
        },
        "description": "Selezionare il tipo corretto di sistema di riscaldamento è importante affinché il SAT possa controllare accuratamente la temperatura e ottimizzare le prestazioni. Scegli l'opzione che corrisponde alla tua configurazione per garantire una regolazione appropriata della temperatura in tutta la tua casa.",
        "title": "Sistema di Riscaldamento"
      },
      "mosquitto": {
        "description": "Seleziona il tipo di gateway così SAT sa quali topic MQTT usare.",
        "data": {
          "mode": "Modalità"
        },
        "data_description": {
          "mode": "Scegli il tipo di gateway così SAT conosce il formato del topic MQTT atteso."
        },
        "title": "Configurazione MQTT"
      },
      "mosquitto_opentherm": {
        "description": "Inserisci il topic MQTT di base (es. {example_otgw_topic}) e l'identificativo del dispositivo.",
        "data": {
          "name": "Nome",
          "mqtt_topic": "Argomento MQTT",
          "device": "ID del dispositivo"
        },
        "data_description": {
          "name": "Nome visualizzato in Home Assistant.",
          "mqtt_topic": "Topic base usato dal gateway (es. OTGW/ o OTGW/ABCDEF).",
          "device": "Identificatore del gateway (spesso l’ID OTGW)."
        },
        "title": "Configurazione del Gateway OpenTherm"
      },
      "mosquitto_ems": {
        "description": "Inserisci il topic MQTT di base (es. {example_ems_topic}).",
        "data": {
          "name": "Nome",
          "mqtt_topic": "Argomento MQTT"
        },
        "data_description": {
          "name": "Nome visualizzato in Home Assistant.",
          "mqtt_topic": "Topic base usato da EMS-ESP (es. ems-esp/)."
        },
        "title": "Configurazione del Gateway EMS-ESP"
      },
      "mosquitto_otthing": {
        "description": "Inserisci il topic di base senza /state (es. {example_otthing_topic}).",
        "data": {
          "name": "Nome",
          "mqtt_topic": "Argomento MQTT"
        },
        "data_description": {
          "name": "Nome visualizzato in Home Assistant.",
          "mqtt_topic": "Topic base senza /state (es. otthing/31F44C)."
        },
        "title": "Configurazione del gateway OTthing"
      },
      "esphome": {
        "description": "Seleziona il dispositivo ESPHome e assegna un nome.",
        "data": {
          "name": "Nome",
          "device": "Dispositivo"
        },
        "data_description": {
          "name": "Nome visualizzato in Home Assistant.",
          "device": "Dispositivo ESPHome da usare."
        },
        "title": "Configurazione ESPHome"
      },
      "overshoot_protection": {
        "data": {
          "minimum_setpoint": "Valore"
        },
        "description": "Fornendo il valore di protezione dal superamento, il SAT regolerà di conseguenza i parametri di controllo per mantenere un ambiente di riscaldamento stabile e confortevole. Questa configurazione manuale ti consente di affinare il sistema in base alla tua configurazione specifica.\n\nNota: Se non sei sicuro del valore di protezione dal superamento o non hai eseguito il processo di calibrazione, si raccomanda di annullare la configurazione e procedere con il processo di calibrazione per consentire al SAT di determinare automaticamente il valore per prestazioni ottimali.",
        "title": "Protezione dal Superamento"
      },
      "pid_controller": {
        "data": {
          "derivative": "Derivativo (kD)",
          "integral": "Integrale (kI)",
          "proportional": "Proporzionale (kP)"
        },
        "description": "Configura manualmente i guadagni proporzionale, integrale e derivativo per affinare il tuo sistema di riscaldamento. Utilizza questa opzione se preferisci avere il pieno controllo sui parametri del controller PID. Regola i guadagni in base alle caratteristiche specifiche del tuo sistema di riscaldamento e alle tue preferenze.",
        "title": "Configura manualmente il controller PID."
      },
      "sensors": {
        "data": {
          "humidity_sensor_entity_id": "Entità Sensore Umidità",
          "inside_sensor_entity_id": "Entità Sensore Interno",
          "outside_sensor_entity_id": "Entità Sensore Esterno"
        },
        "data_description": {
          "inside_sensor_entity_id": "Sensore principale della temperatura interna.",
          "outside_sensor_entity_id": "Sensore esterno o entità meteo (selezione multipla possibile).",
          "humidity_sensor_entity_id": "Sensore di umidità opzionale."
        },
        "description": "Seleziona il sensore interno, il/i sensore/i esterno/i e un sensore di umidità opzionale.",
        "title": "Configura sensori"
      },
      "serial": {
        "data": {
          "device": "URL",
          "name": "Nome"
        },
        "data_description": {
          "name": "Nome visualizzato in Home Assistant.",
          "device": "URL socket, es. socket://otgw.local:25238."
        },
        "description": "Inserisci un nome e un URL socket (es. {example_socket}).",
        "title": "Gateway OpenTherm (SERIALE)"
      },
      "simulator": {
        "data": {
          "maximum_setpoint": "Setpoint Massimo",
          "minimum_setpoint": "Setpoint Minimo",
          "name": "Nome",
          "simulated_cooling": "Raffreddamento Simulato",
          "simulated_heating": "Riscaldamento Simulato",
          "simulated_warming_up": "Riscaldamento Simulato"
        },
        "description": "Questo gateway ti consente di simulare una caldaia per scopi di test e dimostrazione. Si prega di fornire le seguenti informazioni per configurare il simulatore.\n\nNota: Il Gateway Simulatore è destinato solo a scopi di test e dimostrazione e non dovrebbe essere utilizzato in ambienti di produzione.",
        "title": "Gateway Simulato (AVANZATO)"
      },
      "switch": {
        "data": {
          "device": "Entità",
          "minimum_setpoint": "Impostazione della Temperatura",
          "name": "Nome"
        },
        "data_description": {
          "name": "Nome visualizzato in Home Assistant.",
          "device": "Interruttore, valvola o input_boolean usato per controllare il riscaldamento.",
          "minimum_setpoint": "Temperatura caldaia per sistemi ad acqua calda; usa 100 per riscaldamento elettrico."
        },
        "description": "Scegli l'entità di controllo e imposta la temperatura. Per caldaie ad acqua calda usa la temperatura della caldaia; per riscaldamento elettrico usa 100.",
        "title": "Termostato PID con Modulazione di Larghezza di Impulso (ON/OFF)"
      },
      "user": {
        "description": "SAT è un termostato intelligente in grado di auto-regolarsi per ottimizzare il controllo della temperatura. Seleziona la modalità che corrisponde al tuo sistema di riscaldamento.",
        "menu_options": {
          "mosquitto": "Gateway MQTT (OpenTherm, EMS-ESP, altri)",
          "serial": "Gateway seriale (es. OpenTherm)",
          "esphome": "ESPHome (Servizi e sensori di sistema)",
          "simulator": "Gateway simulato (Solo per sviluppatori)",
          "switch": "Termostato PID (Modalità Modulazione di Larghezza di Impulso Acceso/Spento)"
        },
        "title": "Smart Autotune Thermostat (SAT)"
      },
      "manufacturer": {
        "description": "Abbiamo tentato di identificare il produttore più adatto al tuo sistema di riscaldamento in base al tipo di gateway e alle informazioni del dispositivo. Se non corrisponde alla tua configurazione, puoi selezionare un produttore diverso dall’elenco.",
        "data": {
          "manufacturer": "Produttore"
        }
      }
    }
  },
  "options": {
    "step": {
      "advanced": {
        "data": {
          "error_monitoring": "Abilita monitoraggio errori",
          "climate_valve_offset": "Offset della Valvola Climatica",
          "dynamic_minimum_setpoint": "Setpoint Minimo Dinamico (Sperimentale)",
          "force_pulse_width_modulation": "Forzare la Modulazione di Larghezza di Impulso ",
          "maximum_consumption": "Consumo Massimo",
          "maximum_relative_modulation": "Modulazione Relativa Massima",
          "minimum_consumption": "Consumo Minimo",
          "modulation_suppression_offset_celsius": "Offset della soppressione di modulazione",
          "flow_setpoint_offset_celsius": "Offset del setpoint di mandata",
          "sample_time": "Tempo di Campionamento",
          "simulation": "Simulazione",
          "target_temperature_step": "Passo della Temperatura Target",
          "thermal_comfort": "Comfort Termico"
        },
        "data_description": {
          "climate_valve_offset": "Differenza di temperatura (target vs attuale) per considerare una valvola aperta.",
          "dynamic_minimum_setpoint": "Apprende un setpoint minimo dinamico per regime dal comportamento dei cicli per stabilizzare le combustioni e ridurre i cicli brevi.",
          "maximum_consumption": "Consumo di gas alla modulazione massima, usato per stimare i consumi.",
          "maximum_relative_modulation": "Limita la percentuale di modulazione della caldaia (0–100) per ridurre la potenza massima.",
          "minimum_consumption": "Consumo di gas alla modulazione minima, usato per stimare i consumi.",
          "sample_time": "L'intervallo di tempo minimo tra gli aggiornamenti del controllore PID.",
          "target_temperature_step": "Passo di regolazione della temperatura target nell'interfaccia.",
          "thermal_comfort": "Abilitare l'uso dell Indice di Simmer per l'aggiustamento del comfort termico.",
          "simulation": "Abilita la modalità simulazione (non vengono inviati comandi reali alla caldaia).",
          "error_monitoring": "Invia gli errori relativi a SAT a Sentry per aiutare la diagnosi.",
          "force_pulse_width_modulation": "Forza la Modulazione di Larghezza di Impulso anche quando è disponibile la modulazione (utile per controllo a relè).",
          "flame_off_setpoint_offset_celsius": "Con fiamma spenta, mantiene un setpoint temporaneo a ritorno + offset (solo Modulazione di Larghezza di Impulso).",
          "modulation_suppression_delay_seconds": "Tempo dopo l'accensione della fiamma prima della soppressione (solo Modulazione di Larghezza di Impulso).",
          "modulation_suppression_offset_celsius": "Riduzione del setpoint di mandata durante la soppressione (solo Modulazione di Larghezza di Impulso).",
          "flow_setpoint_offset_celsius": "Scarto minimo sotto la temperatura della caldaia durante il limite del setpoint (modalità continua)."
        },
        "title": "Avanzate"
      },
      "general": {
        "data": {
          "automatic_gains_value": "Valore dei Guadagni Automatici",
          "derivative": "Derivata (kD)",
          "derivative_time_weight": "Peso Temporale Derivato",
          "duty_cycle": "Ciclo di Lavoro Massimo per la Modulazione di Larghezza di Impulso",
          "heating_curve_coefficient": "Coefficiente della Curva di Riscaldamento",
          "heating_curve_version": "Versione della Curva di Riscaldamento",
          "integral": "Integrale (kI)",
          "maximum_setpoint": "Setpoint Massimo",
          "dynamic_minimum_setpoint_version": "Versione del controllore del setpoint minimo",
          "pid_controller_version": "Versione del controllore PID",
          "proportional": "Proporzionale (kP)",
          "window_sensors": "Sensori Contatto",
          "heating_mode": "Modalità riscaldamento"
        },
        "data_description": {
          "automatic_gains_value": "Il valore utilizzato per i guadagni automatici nel controllore PID.",
          "derivative": "Il termine derivato (kD) nel controllore PID, responsabile della mitigazione del superamento.",
          "derivative_time_weight": "Un parametro per regolare l'influenza del termine derivato nel tempo, particolarmente utile per ridurre il sotto scavo durante la fase di riscaldamento quando il coefficiente della curva di riscaldamento è correttamente impostato.",
          "duty_cycle": "Il ciclo di lavoro massimo per la Modulazione di Larghezza di Impulso , controllando i cicli di accensione/spegnimento della caldaia.",
          "heating_curve_coefficient": "Il coefficiente utilizzato per regolare la curva di riscaldamento.",
          "integral": "Il termine integrale (kI) nel controllore PID, responsabile della riduzione dell'errore in stato stazionario.",
          "maximum_setpoint": "La temperatura ottimale per un funzionamento efficiente della caldaia.",
          "proportional": "Il termine proporzionale (kP) nel controllore PID, responsabile della risposta immediata agli errori.",
          "window_sensors": "Sensori di Contatto che attivano il sistema quando una finestra o una porta è aperta per un periodo di tempo."
        },
        "description": "Impostazioni principali di controllo del riscaldamento (limiti, curva, sensori).",
        "title": "Generale"
      },
      "init": {
        "menu_options": {
          "advanced": "Opzioni Avanzate",
          "general": "Generale",
          "presets": "Pre-impostazioni",
          "areas": "Aree",
          "system_configuration": "Configurazione del Sistema"
        }
      },
      "areas": {
        "description": "Imposta i pesi delle stanze per dare priorità a quelle con maggiore richiesta.",
        "title": "Aree"
      },
      "presets": {
        "data": {
          "activity_temperature": "Temperatura Attività",
          "away_temperature": "Temperatura Assente",
          "comfort_temperature": "Temperatura Comfort",
          "home_temperature": "Temperatura Casa",
          "sleep_temperature": "Temperatura Sonno",
          "push_setpoint_to_thermostat": "Sincronizza setpoint con termostato",
          "sync_climates_with_preset": "Sincronizza climi con pre-impostazione (sonno / assente / attività)"
        },
        "description": "Imposta le temperature dei preset e la loro sincronizzazione con altri climi.",
        "title": "Pre-impostazioni",
        "data_description": {
          "sync_climates_with_preset": "Quando si seleziona un preset, applica quella temperatura ai climi delle stanze.",
          "push_setpoint_to_thermostat": "Invia la temperatura obiettivo di SAT al termostato della caldaia."
        }
      },
      "system_configuration": {
        "data": {
          "cycles_per_hour": "Cicli per ora",
          "automatic_duty_cycle": "Ciclo di lavoro automatico",
          "sync_climates_with_mode": "Sincronizza climi con la modalità",
          "overshoot_protection": "Protezione dal Superamento (con Modulazione di Larghezza di Impulso )",
          "sensor_max_value_age": "Età massima del valore del sensore di temperatura",
          "window_minimum_open_time": "Tempo minimo di apertura della finestra"
        },
        "data_description": {
          "cycles_per_hour": "Il numero massimo di cicli per ora.",
          "automatic_duty_cycle": "Abilitare o disabilitare il ciclo di lavoro automatico per la Modulazione di Larghezza di Impulso .",
          "overshoot_protection": "Abilitare la protezione dal superamento con la Modulazione di Larghezza di Impulso per prevenire il superamento della temperatura della caldaia.",
          "sensor_max_value_age": "L'età massima del valore del sensore di temperatura prima di considerarlo stazionario.",
          "window_minimum_open_time": "Il tempo minimo che una finestra deve essere aperta prima che il sistema reagisca.",
          "sync_climates_with_mode": "Applica anche la modalità HVAC ai climi delle stanze quando cambia qui."
        },
        "description": "Comportamento di temporizzazione e sincronizzazione per cicli, sensori e modalità HVAC.",
        "title": "Configurazione del Sistema"
      }
    }
  },
  "services": {
    "reset_integral": {
      "name": "Reimposta integrale",
      "description": "Questo servizio reimposta la parte integrale del controller PID per l’entità climate specificata. Può essere utile se il valore integrale è diventato troppo grande o se le prestazioni del PID sono peggiorate."
    },
    "pulse_width_modulation": {
      "name": "Modulazione a larghezza d’impulso ",
      "description": "Forza l’attivazione o la disattivazione della modulazione a larghezza d’impulso . Nota che può essere riattivata o disattivata automaticamente subito dopo.",
      "fields": {
        "enabled": {
          "name": "Abilitato",
          "description": "Lo stato che vuoi forzare."
        }
      }
    }
  }
}
