{
  "config": {
    "abort": {
      "already_configured": "O Gateway já está configurado.",
      "reconfigure_successful": "O Gateway foi reconfigurado com sucesso."
    },
    "error": {
      "invalid_device": "Este é um dispositivo inválido.",
      "connection": "Não foi possível ligar ao gateway.",
      "mqtt_component": "O componente MQTT não está disponível.",
      "unable_to_calibrate": "O processo de calibração encontrou um problema e não pôde ser concluído com sucesso. Por favor, assegure-se de que o seu sistema de aquecimento está a funcionar corretamente e que todos os sensores necessários estão ligados e a funcionar corretamente.\n\nSe continuar a ter problemas com a calibração, considere contactar-nos para obter mais assistência. Pedimos desculpa por qualquer inconveniente causado."
    },
    "progress": {
      "calibration": "A calibrar e a encontrar o valor de proteção contra overshoot...\n\nPor favor, aguarde enquanto otimizamos o seu sistema de aquecimento. Este processo pode demorar aproximadamente 20 minutos."
    },
    "step": {
      "areas": {
        "data": {
          "thermostat": "Termóstato",
          "main_climates": "Principal",
          "secondary_climates": "Quartos"
        },
        "data_description": {
          "thermostat": "Termóstato existente opcional para sincronizar os setpoints.",
          "main_climates": "Radiadores na mesma sala que o sensor interno.",
          "secondary_climates": "Quartos com as suas próprias temperaturas alvo."
        },
        "description": "Definições relacionadas com climas, multi-sala e controlo de temperatura. Climas principais estão na mesma sala que o sensor interior e os quartos têm as suas próprias temperaturas alvo separadas do sistema.",
        "title": "Áreas"
      },
      "automatic_gains": {
        "data": {
          "automatic_gains": "Ganhos Automáticos (recomendado)"
        },
        "description": "Esta funcionalidade ajusta os parâmetros de controlo do seu sistema de aquecimento dinamicamente, otimizando o controlo de temperatura para melhor conforto e eficiência energética. Ao ativar esta opção, o SAT adapta-se continuamente e afina as definições de aquecimento com base nas condições ambientais. Isto ajuda a manter um ambiente estável e confortável sem intervenção manual.\n\nNota: Se optar por não ativar os ganhos automáticos, terá de introduzir manualmente os valores PID para controlo preciso da temperatura. Por favor, certifique-se de que tem valores PID precisos para o seu sistema de aquecimento específico para obter desempenho ideal.",
        "title": "Ganhos Automáticos"
      },
      "calibrate_system": {
        "description": "Otimize o seu sistema de aquecimento determinando automaticamente os valores PID ótimos para a sua configuração. Ao selecionar Ganhos Automáticos, por favor note que o sistema passará por um processo de calibração que pode demorar aproximadamente 20 minutos a completar.\n\nGanhos Automáticos é recomendado para a maioria dos utilizadores, pois simplifica o processo de configuração e assegura desempenho ideal. No entanto, se estiver familiarizado com controlo PID e preferir definir os valores manualmente, pode optar por ignorar os Ganhos Automáticos.\n\nPor favor note que escolher ignorar os Ganhos Automáticos requer um bom entendimento de controlo PID e pode requerer ajustes manuais adicionais para alcançar desempenho ótimo.",
        "menu_options": {
          "calibrate": "Calibrar e determinar o valor de proteção contra overshoot (aprox. 20 min).",
          "overshoot_protection": "Introduzir manualmente o valor de proteção contra overshoot.",
          "pid_controller": "Introduzir manualmente os valores PID (não recomendado)."
        },
        "title": "Calibrar Sistema"
      },
      "calibrated": {
        "description": "O processo de calibração foi concluído com sucesso.\n\nParabéns! O seu Termóstato Smart Autotune (SAT) foi calibrado para otimizar o desempenho de aquecimento do seu sistema. Durante o processo de calibração, o SAT analisou cuidadosamente as características de aquecimento e determinou o valor apropriado de proteção contra overshoot para assegurar controlo de temperatura preciso.\n\nValor de Proteção contra Overshoot: {minimum_setpoint} °C\n\nEste valor representa a quantidade máxima de overshoot permitida durante o processo de aquecimento. O SAT irá monitorizar ativamente e ajustar o aquecimento para prevenir overshoot excessivo, mantendo uma experiência de aquecimento confortável e eficiente na sua casa.\n\nPor favor note que o valor de proteção contra overshoot pode variar dependendo das características específicas do seu sistema de aquecimento e fatores ambientais. Foi afinado para fornecer desempenho ótimo com base nos resultados da calibração.",
        "menu_options": {
          "calibrate": "Repetir calibração",
          "finish": "Continuar com a calibração atual"
        },
        "title": "Calibração Concluída"
      },
      "heating_system": {
        "data": {
          "heating_system": "Sistema"
        },
        "data_description": {
          "heating_system": "Escolha o sistema que corresponde aos seus emissores de calor."
        },
        "description": "Selecionar o tipo correto de sistema de aquecimento é importante para que o SAT controle com precisão a temperatura e otimize o desempenho. Escolha a opção que corresponde à sua configuração para assegurar regulação adequada da temperatura em toda a sua casa.",
        "title": "Sistema de Aquecimento"
      },
      "mosquitto": {
        "description": "Selecione o tipo de gateway para que o SAT saiba quais tópicos MQTT usar.",
        "data": {
          "mode": "Modo"
        },
        "data_description": {
          "mode": "Escolha o tipo de gateway para que o SAT conheça o formato de tópico MQTT esperado."
        },
        "title": "Configuração MQTT"
      },
      "mosquitto_opentherm": {
        "description": "Informe o tópico MQTT base (ex.: {example_otgw_topic}) e o identificador do dispositivo.",
        "data": {
          "name": "Nome",
          "mqtt_topic": "Tópico MQTT",
          "device": "ID do dispositivo"
        },
        "data_description": {
          "name": "Nome exibido no Home Assistant.",
          "mqtt_topic": "Tópico base usado pelo gateway (ex.: OTGW/ ou OTGW/ABCDEF).",
          "device": "Identificador do gateway (geralmente o ID do OTGW)."
        },
        "title": "Configuração do Gateway OpenTherm"
      },
      "mosquitto_ems": {
        "description": "Informe o tópico MQTT base (ex.: {example_ems_topic}).",
        "data": {
          "name": "Nome",
          "mqtt_topic": "Tópico MQTT"
        },
        "data_description": {
          "name": "Nome exibido no Home Assistant.",
          "mqtt_topic": "Tópico base usado pelo EMS-ESP (ex.: ems-esp/)."
        },
        "title": "Configuração do Gateway EMS-ESP"
      },
      "mosquitto_otthing": {
        "description": "Informe o tópico base sem /state (ex.: {example_otthing_topic}).",
        "data": {
          "name": "Nome",
          "mqtt_topic": "Tópico MQTT"
        },
        "data_description": {
          "name": "Nome exibido no Home Assistant.",
          "mqtt_topic": "Tópico base sem /state (ex.: otthing/31F44C)."
        },
        "title": "Configuração do gateway OTthing"
      },
      "esphome": {
        "description": "Selecione o dispositivo ESPHome e dê-lhe um nome.",
        "data": {
          "name": "Nome",
          "device": "Dispositivo"
        },
        "data_description": {
          "name": "Nome exibido no Home Assistant.",
          "device": "Dispositivo ESPHome a usar."
        },
        "title": "Configuração ESPHome"
      },
      "overshoot_protection": {
        "data": {
          "minimum_setpoint": "Valor"
        },
        "description": "Ao fornecer o valor de proteção contra overshoot, o SAT ajustará os parâmetros de controlo em conformidade para manter um ambiente de aquecimento confortável e estável. Esta configuração manual permite-lhe afinar o sistema com base na sua configuração específica.\n\nNota: Se não tiver certeza sobre o valor de proteção contra overshoot ou não tiver realizado o processo de calibração, é recomendado cancelar a configuração e passar pelo processo de calibração para permitir que o SAT determine automaticamente o valor para desempenho ótimo.",
        "title": "Proteção contra Overshoot"
      },
      "pid_controller": {
        "data": {
          "derivative": "Derivativo (kD)",
          "integral": "Integral (kI)",
          "proportional": "Proporcional (kP)"
        },
        "description": "Configure os ganhos proporcional, integral e derivativo manualmente para afinar o seu sistema de aquecimento. Use esta opção se preferir ter controlo total sobre os parâmetros do controlador PID. Ajuste os ganhos com base nas características e preferências específicas do seu sistema de aquecimento.",
        "title": "Configurar o controlador PID manualmente."
      },
      "sensors": {
        "data": {
          "humidity_sensor_entity_id": "Entidade do Sensor de Humidade",
          "inside_sensor_entity_id": "Entidade do Sensor Interior",
          "outside_sensor_entity_id": "Entidade do Sensor Exterior"
        },
        "data_description": {
          "inside_sensor_entity_id": "Sensor principal de temperatura interna.",
          "outside_sensor_entity_id": "Sensor externo ou entidade de clima (pode selecionar vários).",
          "humidity_sensor_entity_id": "Sensor de humidade opcional."
        },
        "description": "Selecione o sensor interno, o(s) sensor(es) externo(s) e um sensor de umidade opcional.",
        "title": "Configurar sensores"
      },
      "serial": {
        "data": {
          "device": "URL",
          "name": "Nome"
        },
        "data_description": {
          "name": "Nome exibido no Home Assistant.",
          "device": "URL de socket, ex.: socket://otgw.local:25238."
        },
        "description": "Digite um nome e uma URL de socket (ex.: {example_socket}).",
        "title": "OpenTherm Gateway ( SERIAL )"
      },
      "simulator": {
        "data": {
          "maximum_setpoint": "Setpoint Máximo",
          "minimum_setpoint": "Setpoint Mínimo",
          "name": "Nome",
          "simulated_cooling": "Arrefecimento Simulado",
          "simulated_heating": "Aquecimento Simulado",
          "simulated_warming_up": "Aquecimento Inicial Simulado"
        },
        "description": "Este gateway permite-lhe simular uma caldeira para fins de teste e demonstração. Por favor forneça as seguintes informações para configurar o simulador.\n\nNota: O Simulador Gateway destina-se apenas a fins de teste e demonstração e não deve ser usado em ambientes de produção.",
        "title": "Gateway Simulado ( AVANÇADO )"
      },
      "switch": {
        "data": {
          "device": "Entidade",
          "minimum_setpoint": "Definição de Temperatura",
          "name": "Nome"
        },
        "data_description": {
          "name": "Nome exibido no Home Assistant.",
          "device": "Interruptor, válvula ou input_boolean usado para controlar o aquecimento.",
          "minimum_setpoint": "Temperatura da caldeira para sistemas de água quente; use 100 para aquecimento elétrico."
        },
        "description": "Escolha a entidade de controle e defina a temperatura. Para caldeiras de água quente, use a temperatura da caldeira; para aquecimento elétrico, use 100.",
        "title": "Termóstato PID com Modulação por Largura de Pulso (LIGA/DESLIGA)"
      },
      "user": {
        "description": "SAT é um termostato inteligente capaz de autoajustar-se para otimizar o controle de temperatura. Escolha o modo que corresponde ao seu sistema de aquecimento.",
        "menu_options": {
          "mosquitto": "Gateway MQTT (OpenTherm, EMS-ESP, outros)",
          "serial": "Gateway Serial (ex.: OpenTherm)",
          "esphome": "ESPHome (Serviços e sensores do sistema)",
          "simulator": "Gateway Simulado (Apenas para desenvolvedores)",
          "switch": "Termostato PID (Modo Modulação por Largura de Pulso Ligado/Desligado)"
        },
        "title": "Smart Autotune Thermostat (SAT)"
      },
      "manufacturer": {
        "description": "Tentámos identificar o fabricante mais adequado para o seu sistema de aquecimento com base no tipo de gateway e nas informações do dispositivo. Se não corresponder à sua configuração, pode selecionar um fabricante diferente na lista.",
        "data": {
          "manufacturer": "Fabricante"
        }
      }
    }
  },
  "options": {
    "step": {
      "advanced": {
        "data": {
          "error_monitoring": "Ativar monitoramento de erros",
          "climate_valve_offset": "Offset da válvula do clima",
          "force_pulse_width_modulation": "Forçar Modulação por Largura de Pulso ",
          "maximum_consumption": "Consumo Máximo",
          "maximum_relative_modulation": "Modulação Relativa Máxima",
          "minimum_consumption": "Consumo Mínimo",
          "modulation_suppression_offset_celsius": "Deslocamento da supressão de modulação",
          "flow_setpoint_offset_celsius": "Deslocamento do setpoint de ida",
          "sample_time": "Tempo de Amostragem",
          "simulation": "Simulação",
          "target_temperature_step": "Passo da Temperatura Alvo",
          "thermal_comfort": "Conforto Térmico"
        },
        "data_description": {
          "climate_valve_offset": "Diferença de temperatura (alvo vs atual) para considerar uma válvula aberta.",
          "maximum_consumption": "Consumo de gás na modulação máxima, usado para estimar o consumo.",
          "maximum_relative_modulation": "Limita a porcentagem de modulação da caldeira (0–100) para restringir a potência máxima.",
          "minimum_consumption": "Consumo de gás na modulação mínima, usado para estimar o consumo.",
          "sample_time": "O intervalo de tempo mínimo entre atualizações do controlador PID.",
          "target_temperature_step": "Passo de ajuste da temperatura alvo na interface.",
          "thermal_comfort": "Ativar o uso do Índice de Simmer para ajuste do conforto térmico.",
          "simulation": "Ativar modo de simulação (nenhum comando real é enviado à caldeira).",
          "error_monitoring": "Envia erros relacionados ao SAT para o Sentry para ajudar no diagnóstico.",
          "force_pulse_width_modulation": "Forçar a Modulação por Largura de Pulso mesmo quando há controle de modulação (útil para relé).",
          "flame_off_setpoint_offset_celsius": "Com a chama desligada, mantém um setpoint temporário em retorno + offset (somente Modulação por Largura de Pulso).",
          "modulation_suppression_delay_seconds": "Tempo após a chama ligar antes de aplicar a supressão (somente Modulação por Largura de Pulso).",
          "modulation_suppression_offset_celsius": "Quanto reduzir o setpoint de ida durante a supressão (somente Modulação por Largura de Pulso).",
          "flow_setpoint_offset_celsius": "Diferença mínima abaixo da temperatura da caldeira ao limitar o setpoint (modo contínuo)."
        },
        "title": "Avançado"
      },
      "general": {
        "data": {
          "automatic_gains_value": "Valor de Ganhos Automáticos",
          "derivative": "Derivativo (kD)",
          "derivative_time_weight": "Peso Temporal do Derivativo",
          "duty_cycle": "Ciclo de Trabalho Máximo para Modulação por Largura de Pulso",
          "heating_curve_coefficient": "Coeficiente da Curva de Aquecimento",
          "heating_curve_version": "Versão da Curva de Aquecimento",
          "integral": "Integral (kI)",
          "maximum_setpoint": "Setpoint Máximo",
          "pid_controller_version": "Versão do Controlador PID",
          "proportional": "Proporcional (kP)",
          "window_sensors": "Sensores de Contato",
          "heating_mode": "Modo de Aquecimento"
        },
        "data_description": {
          "automatic_gains_value": "O valor usado para ganhos automáticos no controlador PID.",
          "derivative": "O termo derivativo (kD) no controlador PID, responsável por mitigar overshooting.",
          "derivative_time_weight": "Um parâmetro para ajustar a influência do termo derivativo ao longo do tempo, particularmente útil para reduzir undershoot durante a fase de aquecimento quando o coeficiente da curva de aquecimento está corretamente definido.",
          "duty_cycle": "O ciclo de trabalho máximo para Modulação por Largura de Pulso , controlando os ciclos de ligar/desligar da caldeira.",
          "heating_curve_coefficient": "O coeficiente usado para ajustar a curva de aquecimento.",
          "integral": "O termo integral (kI) no controlador PID, responsável por reduzir o erro em regime permanente.",
          "maximum_setpoint": "A temperatura ótima para operação eficiente da caldeira.",
          "proportional": "O termo proporcional (kP) no controlador PID, responsável pela resposta imediata a erros.",
          "window_sensors": "Sensores de Contato que ativam o sistema para reagir quando uma janela ou porta está aberta por um período de tempo."
        },
        "description": "Configurações principais de controle de aquecimento (limites, curva, sensores).",
        "title": "Geral"
      },
      "init": {
        "menu_options": {
          "advanced": "Opções Avançadas",
          "general": "Geral",
          "presets": "Predefinições",
          "areas": "Áreas",
          "system_configuration": "Configuração do Sistema"
        }
      },
      "areas": {
        "description": "Defina pesos por ambiente para priorizar os de maior demanda.",
        "title": "Áreas"
      },
      "presets": {
        "data": {
          "activity_temperature": "Temperatura de Atividade",
          "away_temperature": "Temperatura Ausente",
          "comfort_temperature": "Temperatura de Conforto",
          "home_temperature": "Temperatura em Casa",
          "sleep_temperature": "Temperatura de Sono",
          "push_setpoint_to_thermostat": "Sincronizar setpoint com termóstato",
          "sync_climates_with_preset": "Sincronizar climas com predefinição (sono / ausente / atividade)"
        },
        "description": "Defina temperaturas dos presets e como sincronizam com outros climas.",
        "title": "Predefinições",
        "data_description": {
          "sync_climates_with_preset": "Quando um preset é selecionado, aplica essa temperatura aos climas dos ambientes.",
          "push_setpoint_to_thermostat": "Envia a temperatura alvo do SAT para o termostato da caldeira."
        }
      },
      "system_configuration": {
        "data": {
          "cycles_per_hour": "Ciclos por hora",
          "automatic_duty_cycle": "Ciclo de trabalho automático",
          "sync_climates_with_mode": "Sincronizar climas com o modo",
          "overshoot_protection": "Proteção contra Overshoot (com Modulação por Largura de Pulso )",
          "sensor_max_value_age": "Idade máxima do valor do sensor de temperatura",
          "window_minimum_open_time": "Tempo mínimo para a janela estar aberta"
        },
        "data_description": {
          "cycles_per_hour": "A quantidade máxima de ciclos por hora.",
          "automatic_duty_cycle": "Ativar ou desativar ciclo de trabalho automático para Modulação por Largura de Pulso .",
          "overshoot_protection": "Ativar proteção contra overshoot com Modulação por Largura de Pulso para evitar overshooting da temperatura da caldeira.",
          "sensor_max_value_age": "A idade máxima do valor do sensor de temperatura antes de ser considerado como estagnado.",
          "window_minimum_open_time": "O tempo mínimo que uma janela deve estar aberta antes de o sistema reagir.",
          "sync_climates_with_mode": "Também aplica o modo HVAC aos climas dos ambientes quando alterado aqui."
        },
        "description": "Comportamento de tempo e sincronização para ciclos, sensores e modo HVAC.",
        "title": "Configuração do Sistema"
      }
    }
  },
  "services": {
    "reset_integral": {
      "name": "Redefinir integral",
      "description": "Este serviço redefine a parte integral do controlador PID para a entidade climate especificada. Pode ser útil se o valor integral ficou demasiado grande ou se o desempenho do PID se degradou."
    },
    "pulse_width_modulation": {
      "name": "Modulação por largura de pulso ",
      "description": "Forçar ativar ou desativar a Modulação por Largura de Pulso . Note que pode ser ativada ou desativada automaticamente logo a seguir.",
      "fields": {
        "enabled": {
          "name": "Ativado",
          "description": "O estado que pretende forçar."
        }
      }
    }
  }
}
